{
    "Project": {
        "description": "Root node for the Software Requirements Specification.",
        "UserStories": {
            "Story": {
                "description": "A specific user story capturing a functional requirement.",
                "body": "The user story text (As a <role>, I want <feature>, so that <benefit>)."
            }
        },
        "CoreProcesses": {
            "Process": {
                "description": "The name of a specific internal/core process that must be implemented for the application to work. A process connects together User stories, Data Structures, internal and external endpoints and User Controls in one unit.",
                "body": "The whole description of the process including Name, how should it be implemented (including processes to be completed, input, output, events it responds to, entities and components involved, technologies used)"
            }
        },
        "NonFunctionalRequirements": {
            "Requirement": {
                "description": "A specific non-functional requirement or constraint.",
                "body": "Details of the requirement (e.g., performance target, safety constraint, reliability, security, compliance)."
            }
        },
        "Components": {
            "Component": {
                "description": "The Name of a specific Software Component (internal class component, Database, system layer, external service/server) that must exists for Core Processes and User Stories to be implemented. The component must be referred by name.",
                "body": "The description of the Component, its role and responsibilities, the core processes and user stories it is connected with, as well as any Data structore, internal/external API it manages/uses and the technologies used for the implementation."
            }
        },
        "CoreDataStructures": {
            "DataModel": {
                "description": "The Name of a specific domain data structure or model used by the system.",
                "body": "The formal definition of the data model (e.g., JSON schema, TypeScript interface, protobuf message, SQL table)."
            }
        },
        "APIEndpoints": {
            "Endpoint": {
                "description": "The Name of a specific logical API endpoint exposed by the system.",
                "body": "Details of the endpoint including method, path or operation name, request/response contracts, auth, and error semantics."
            }
        },
        "ExternalInterfaces": {
            "Interface": {
                "description": "The Name of a specific external or hardware interface the system interacts with.",
                "body": "Protocol details, commands, timing, transport characteristics, and data exchanged."
            }
        },
        "UIComponents": {
            "Component": {
                "description": "The Name of a specific UI component, screen, or interactive element.",
                "body": "Description of the component, its props/inputs, state, behavior, events and interaction patterns."
            }
        },
        "TechnologiesInvolved": {
            "Tech": {
                "description": "The Name of a Specific Technology used in the project",
                "body": "Specific Description of how the technology is it gonna be used in the project"
            }
        }
    }
}
